| Category            | Score | Notes |
|---------------------+-------+-------|
| Correctness  (24)   |    24 |       |
|---------------------+-------+-------|
| structure (49)      |    49 |       |
| Documentation  (15) |    15 |       |
| Testing (12)        |    12 |       |
|---------------------+-------+-------|
| Total               |   100 |       |
#+TBLFM: @>$2=vsum(@2..@-1)

* notes
- really nice
